회사 선배의 조언을 기준으로 자기 개발을 위한 계획을 정해보자..
선배 曰 : 이 Tech Study Plan 의 최우선 목적은 야근을 밥먹듯이 하고, 기술 수준에 비해 형편없는 pay 를 지급하며
          , 갑-을-병-정으로 내려가는 불합리한 하도급 구조를 갖는 SI 업계에서 탈출하거나 능력장로 살아가기 위한는 것입니다.
          따라서 SI 업계 바깥에서 선호받는 개발자들의 강력한 무기를 2년 내에 습득하는 것이 그 공략이 될 수 있다고 생각해요.
          물론 회사를 그만두지 않는 것도 훌륭한 선택입니다. 
          회사에 머무른다 하더라도 우리가 공부한 내용은 내공이 되어 앞으로도 많은 도움이 될 겁니다.

1. 다음 기술들을 책 / 인터넷을 활용하여 기간을 정하고 개론 수준으로 학습합니다. 
   학습 후에는 공유 / 추후 활용을 위해 정리하는 문서를 작성한다.
   먼저 공부할 내용만 추가한 후, 학습이 끝나면 목록에 추가한다.

2. 개론 수준으로 공부한 것들 중, 자신의 취향 또는 적성에 맞는 것으로 느껴지는 기술을 1년간 심화 학습합니다.
2년 후 전문가가 될 것을 목표로 공부한다.

3. 학습 내용
언어 : 영어 읽기/쓰기(회화 위주 : 지하철로 오가는 시간을 활용)
       Java 8, 9 (2017년 3월 출시 예정) - 함수형 코딩 패턴 중심으로

서버/OS : Linux(ubuntu 14. LTS)

프레임워크/라이브러리 : spring, 

DB : oracle

트렌드 기술 : Git / GitHub

기본기 : 알고리즘
       , 정규표현식
       , Bash Shell
       , PowerShell
       , 에디터 (Eclipse, VI/VIM)
       , SQL 
